key_descriptions = {
    'device_address': '模拟器的ADB地址',
    'state': '状态',
    'x': '土地坐标X',
    'y': '土地坐标Y',
    'mode': '打城模式：1:守军未消失时，主力一直上，拆迁拆到没体力。2：主力跟拆迁一直上',
    'nexttime': '下一次运行的时间',
    'endtime': '最后结束时间',
    'looptime': '多少分钟后开始循环',
    'stage': '当前队伍步骤阶段。不需要手动更改',
    'draft': '战斗后是否征兵',
    'address': '从要塞/主城出发。 部队从主城出发，则留空，不填。从要塞出发，填写要塞名字。',
    'num': '在势力页面中，基于主城的部队位置。注意:部队在要塞中的位置可能是不一致的',
    'action_list': '根据要塞/主城所在部队的位置填写',
    'max_distance': '出发最大距离',
    'time_consuming': '出发/撤退耗费时间，一般不需要手动更改',
    'my_remaining': '平局时，我方大于该数量，则等待下一次战斗。与下方条件并列',
    'enemy_remaining': '平局时，守军小于该数量，则等待下一次战斗。与上方条件并列'
}
